# 4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

pol = int(input('Введите положительное число: '))
s = 0
while pol > 0:
    d = pol % 10
    if d >= s: s = d
    pol//= 10
print(s)
