# 5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким
# финансовым результатом работает фирма. Например, прибыль — выручка больше издержек,
# или убыток — издержки больше выручки. Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки. Это отношение
# прибыли к выручке. Далее запросите численность сотрудников фирмы и определите прибыль
# фирмы в расчёте на одного сотрудника.

vyr = int(input('Введите выручку '))
izd = int(input('Введите издержки '))
p = vyr - izd
if vyr > izd:
    print('Прибыль', p)
    sot = int(input('Введите кол-во сотрудников '))
    print('Выручка на 1 сотрудника: ', p / sot)
else:
    print('Убыток')